In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("income.csv", names=["name","income"], skiprows=[0])

In [3]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [4]:
df.shape

(7, 2)

In [6]:
percentile_99 = df.income.quantile(0.99)
percentile_99

9400479.999999994

In [7]:
df[df.income > percentile_99]

        name    income
6  Elon Musk  10000000

In [8]:
df_no_outlier = df[df.income <= percentile_99]
df_no_outlier

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [14]:
df["income"][3] = np.nan

In [12]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [15]:
df_new = df.fillna(df.income.median())
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0